# DataFrames

We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [1]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.randn(5,4)
index = 'A B C D E'.split()
columns = 'W X Y Z'.split()
df = pd.DataFrame(data=data, index=index, columns=columns)

In [5]:
df

          W         X         Y         Z
A  0.621441  0.914287  0.197179  0.660144
B  0.237583  1.618880 -0.309993 -0.708922
C -0.166667  1.230928 -1.339824  0.011684
D  0.779813 -0.011385 -0.398488  0.782948
E -1.089607 -1.308725  0.074030 -0.243092

## Selection and Indexing

In [6]:
df['W']

A    0.621441
B    0.237583
C   -0.166667
D    0.779813
E   -1.089607
Name: W, dtype: float64

In [7]:
df[['W', 'Z']]

          W         Z
A  0.621441  0.660144
B  0.237583 -0.708922
C -0.166667  0.011684
D  0.779813  0.782948
E -1.089607 -0.243092

**Creating a new column:**

In [8]:
df['ZZ'] = df['W'] + df['Z']

In [9]:
df

          W         X         Y         Z        ZZ
A  0.621441  0.914287  0.197179  0.660144  1.281585
B  0.237583  1.618880 -0.309993 -0.708922 -0.471339
C -0.166667  1.230928 -1.339824  0.011684 -0.154983
D  0.779813 -0.011385 -0.398488  0.782948  1.562761
E -1.089607 -1.308725  0.074030 -0.243092 -1.332698

**Deleting a column:**

In [10]:
df.drop('ZZ', axis=1)

          W         X         Y         Z
A  0.621441  0.914287  0.197179  0.660144
B  0.237583  1.618880 -0.309993 -0.708922
C -0.166667  1.230928 -1.339824  0.011684
D  0.779813 -0.011385 -0.398488  0.782948
E -1.089607 -1.308725  0.074030 -0.243092

In [11]:
# Not inplace unless specified!
df

          W         X         Y         Z        ZZ
A  0.621441  0.914287  0.197179  0.660144  1.281585
B  0.237583  1.618880 -0.309993 -0.708922 -0.471339
C -0.166667  1.230928 -1.339824  0.011684 -0.154983
D  0.779813 -0.011385 -0.398488  0.782948  1.562761
E -1.089607 -1.308725  0.074030 -0.243092 -1.332698

In [13]:
df.drop('ZZ',axis=1,inplace=True)
df

          W         X         Y         Z
A  0.621441  0.914287  0.197179  0.660144
B  0.237583  1.618880 -0.309993 -0.708922
C -0.166667  1.230928 -1.339824  0.011684
D  0.779813 -0.011385 -0.398488  0.782948
E -1.089607 -1.308725  0.074030 -0.243092

**Can also drop rows this way:**

In [14]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.621441  0.914287  0.197179  0.660144
B  0.237583  1.618880 -0.309993 -0.708922
C -0.166667  1.230928 -1.339824  0.011684
D  0.779813 -0.011385 -0.398488  0.782948

**Selecting Rows**

In [15]:
df.loc['A']

W    0.621441
X    0.914287
Y    0.197179
Z    0.660144
Name: A, dtype: float64

In [16]:
df.iloc[0]

W    0.621441
X    0.914287
Y    0.197179
Z    0.660144
Name: A, dtype: float64

In [17]:
df.loc[['A','B'],['W','X']]

          W         X
A  0.621441  0.914287
B  0.237583  1.618880

In [18]:
df.iloc[[0,1],[0,1]]

          W         X
A  0.621441  0.914287
B  0.237583  1.618880

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [19]:
# This is boolean masking in action
df>0

       W      X      Y      Z
A   True   True   True   True
B   True   True  False  False
C  False   True  False   True
D   True  False  False   True
E  False  False   True  False

In [20]:
df

          W         X         Y         Z
A  0.621441  0.914287  0.197179  0.660144
B  0.237583  1.618880 -0.309993 -0.708922
C -0.166667  1.230928 -1.339824  0.011684
D  0.779813 -0.011385 -0.398488  0.782948
E -1.089607 -1.308725  0.074030 -0.243092

In [23]:
df[df['W']<0]

          W         X         Y         Z
C -0.166667  1.230928 -1.339824  0.011684
E -1.089607 -1.308725  0.074030 -0.243092

In [24]:
df[df['W']<0][['W', 'Z']]

          W         Z
C -0.166667  0.011684
E -1.089607 -0.243092

**For multiple conditions**

In [25]:
df[(df['W']<0) & (df['X']>0)] # For or use |

          W         X         Y         Z
C -0.166667  1.230928 -1.339824  0.011684

## More Index Details

In [26]:
df

          W         X         Y         Z
A  0.621441  0.914287  0.197179  0.660144
B  0.237583  1.618880 -0.309993 -0.708922
C -0.166667  1.230928 -1.339824  0.011684
D  0.779813 -0.011385 -0.398488  0.782948
E -1.089607 -1.308725  0.074030 -0.243092

In [27]:
# Reset to default 0,1...n index
df.reset_index()
#Note: This is not inplace and the old index becomes a column

  index         W         X         Y         Z
0     A  0.621441  0.914287  0.197179  0.660144
1     B  0.237583  1.618880 -0.309993 -0.708922
2     C -0.166667  1.230928 -1.339824  0.011684
3     D  0.779813 -0.011385 -0.398488  0.782948
4     E -1.089607 -1.308725  0.074030 -0.243092

In [29]:
newindex = 'CA NY WY OR CO'.split()

In [30]:
df['States'] = newindex

In [31]:
df

          W         X         Y         Z States
A  0.621441  0.914287  0.197179  0.660144     CA
B  0.237583  1.618880 -0.309993 -0.708922     NY
C -0.166667  1.230928 -1.339824  0.011684     WY
D  0.779813 -0.011385 -0.398488  0.782948     OR
E -1.089607 -1.308725  0.074030 -0.243092     CO

In [32]:
df.set_index('States')
#Note: Again this is not inplace

               W         X         Y         Z
States
CA      0.621441  0.914287  0.197179  0.660144
NY      0.237583  1.618880 -0.309993 -0.708922
WY     -0.166667  1.230928 -1.339824  0.011684
OR      0.779813 -0.011385 -0.398488  0.782948
CO     -1.089607 -1.308725  0.074030 -0.243092

In [33]:
df

          W         X         Y         Z States
A  0.621441  0.914287  0.197179  0.660144     CA
B  0.237583  1.618880 -0.309993 -0.708922     NY
C -0.166667  1.230928 -1.339824  0.011684     WY
D  0.779813 -0.011385 -0.398488  0.782948     OR
E -1.089607 -1.308725  0.074030 -0.243092     CO

**Note: To retain the old index use reset_index creates a new column and the set_index with new values**

## Multi-Index and Index Hierarchy

In [35]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [36]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [37]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.368330  0.223754
   2  0.676861  0.637202
   3  1.125636 -2.611599
G2 1 -0.303470  0.202897
   2 -0.341674  0.323872
   3 -0.174631  0.176641

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [38]:
df.loc['G1']

          A         B
1 -1.368330  0.223754
2  0.676861  0.637202
3  1.125636 -2.611599

In [39]:
df.loc['G1'].loc[1]

A   -1.368330
B    0.223754
Name: 1, dtype: float64